# Файл з текстами сообщений бота

main_message_online = """🌟 <b>Ми, фонд Сильні, надаємо безоплатну допомогу після пережитого сексуального насилля.</b>

Допомагаємо <b>жінкам, чоловікам та підліткам</b> від 16 років, хто пережив насилля після 24 лютого 2022 року. Якщо ви цивільна або військова людина, жінка, чоловік або особа з ЛГБТІК+ спільноти, чи перебували у стосунках з людиною, яка вчинила насилля. Також існує окрема програма допомоги людям, які пережили сексуальне насилля від військових рф з 2014 року.

Допомогу отримати ви можете незалежно від того, чи хочете звертатись в поліцію, чи є свідки й докази насилля. Також <b>не важливо</b> хто саме вчинив сексуальне насилля: цивільна чи військова людина.

Ви можете отримати допомогу за такими напрямами:

- <b>медична допомога</b> - ми допоможемо з пошуком компетентних лікарів та оплатимо діагностику, необхідні медичні витрати та подальше лікування;

- <b>психологічна підтримка</b> – наші фахівці та фахівчині спеціалізуються на допомозі людям після сексуального насильства, нададуть вам якісну психотерапевтичну допомогу: вислухають та підтримають. Ми не працюємо як гаряча лінія, тому для вас буде узгоджений курс психотерапії у методах з доведеною ефективністю з фахівцем з нашої команди;

- якщо ви захочете розповісти про скоєне насильство, ми та наші партнери допоможемо вам зі зверненням у поліцію, у документуванні злочину та <b>юридичним супроводом 💼</b>.

ℹ️ Усі послуги надаються конфіденційно та безоплатно."""

main_message_offline = """🌙 <b>Дякуємо вам за довіру та силу до нас звернутися!</b>

⏰ На жаль, наша координаторка зможе приєднатися до розмови з вами лише з 09:00 до 20:00 за Київським часом..

❓ <b>Ви потребуєте термінової консультації?</b>"""

help_message_offline_one = """ℹ️ Наш фонд не працює в режимі гарячої лінії. Але є люди й організації, які можуть спробувати вам допомогти у цей момент.

📞 Звертайтеся за номерами <b>цілодобово</b>:

🔸 <code>1547</code> (з мобільного або стаціонарного телефонів) - Урядовий контактний центр. Тут вам зможуть надати інформаційну консультацію, психологічну підтримку, реєстрацію відповідного звернення до державних органів. Цілодобово і безкоштовно.

🔸 <code>116 123</code> (з мобільного) або (зі стаціонарного) - Національна гаряча лінія з попередження домашнього насильства. Тут вам зможуть надати інформаційну, соціально-психологічну та юридичну підтримку. Цілодобово, безкоштовно, анонімно.

Якщо ви перебуваєте у Києві:

🔸 <code>1500</code> (зі стаціонарного) або <code>044 272 1500</code> (з мобільного) - КМЦ гендерної рівності, запобігання та протидії насильству. Міська служба телефону довіри працює конфіденційно, безоплатно та цілодобово.
"""

help_message_offline_two = """💡 Якщо ви не бачите безпосередньої загрози вашому життю зараз, то ви можете сконтактувати із нашим координатором і ми спробуємо надати вам допомогу.

<b>Продовжити?</b>"""

menu_message = """📋 <b>Будь ласка, оберіть варіант, що ви потребуєте на цей момент:</b>

1️⃣ мені потрібна консультація щодо допомоги, яку я можу отримати

2️⃣ мені потрібна психологічна допомога

3️⃣ мені потрібна медична допомога

4️⃣ мені потрібна консультація юриста щодо скоєного проти мене злочину

5️⃣ я представляю організацію, медіа тощо й хочу звʼязатися з вашою командою   

6️⃣ допомога потрібна не мені, а моїй близькій людині чи підопічній моєї організації   

Ви можете отримати допомогу як за одним із цих напрямків, так і кількома одночасно.   

Після розмови із нашим координатором, ви вільні обирати - прийняти допомогу від нас чи відмовитися від неї.
"""

start_form_message = """👋 <b>Наша координаторка обовʼязково приєднається до розмови починаючи з 9:00 за Київським часом. І ви разом зможете обговорити варіанти допомоги для вас.</b>

📝 Ми були б вам вдячні, якби ви могли ввести координаторку чат-боту у контекст того, що трапилося та відповісти на наступні питання.

💡 Так ми зможемо пришвидшити пошук рішення та/чи допомоги для вас."""

ask_name_form_message = """👤 <b>Як можна до вас звертатися?</b>"""

ask_age_form_message = """📅 <b>Скільки вам років?</b>"""

ask_geo_form_message = """📍 <b>Де ви зараз перебуваєте?</b>"""

ask_where_form_message = """🗺 <b>Де та коли сталась подія?</b>"""

ask_what_form_message = """❓ <b>Якої саме допомоги з запропонованих ви потребуєте, на вашу думку, в першу чергу?</b>"""

ask_description_form_message = """ℹ️ <b>Ми надаємо безоплатно допомогу тим, хто пережив сексуальне насилля після 24 лютого 2022</b>, незалежно від того хто вчинив насилля - військова чи цивільна людина, чи є ви військовою чи цивільною людиною, чи перебували ви у стосунках з людиною яка вчинила насилля, чи хочете ви звертатись в поліцію чи ні, чи є свідки й докази, чи ні.

🔒 <b>Усі послуги надаються конфіденційно та безоплатно.</b>

📝 <b>Будь ласка, опишіть якої саме допомоги ви потребуєте.</b>"""

final_form_message = """✅ <b>Дякую вам за надані відповіді</b>, вони допоможуть одразу взяти ваш запит у роботу та пришвидшать отримання допомоги. 

👩‍💼 Координаторка з'явиться у чаті у робочі години та одразу отримає детальний опис вашого випадку.

Також будемо вдячні якщо ви поділитеся, звідки дізналися про нас. Ваша відповідь допоможе нам ефективніше поширювати інформацію про діяльність фонду, а людям — отримати допомогу, якої вони потребують."""

media_message = """📢 <b>Якщо у вас є запит з приводу співпраці або роботи організації, будь ласка, напишіть нам листа на одну з електронних пошт нижче.</b>

📧 Для співпраці та запитань: <code>hello@sylni.org</code>
📧 Для ЗМІ: <code>communication@sylni.org</code>"""

other_people_help_message = """🤝 <b>Будь ласка, опишіть ваш запит.</b>

👩‍💼 Координаторка звʼяжеться з вами у робочі години."""

cancel_form_message = """Ми з повагою ставимось до вашого рішення. Однак ви завжди можете до нас повернутися, коли будете готові."""

cancel_waiting_help_message = """"Якщо зараз ви нічого не хочете і не потребуєте нічиєї підтримки – це також нормально. Просто знайте, що ми залишаємось на зв'язку, і ви зможете прийти до нас у будь-який момент, коли знадобиться допомога."""